*** Salary Predition using Random Forest ***

In [315]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import r2_score 
from sklearn.preprocessing import LabelEncoder

In [316]:
data = pd.read_csv(r'Main_Dataset.csv')
data

   Location       Job Role  Experience (Years)      Degree   Salary
0   Kolkata   Data Analyst                   0  Bachelor's        0
1   Kolkata   Data Analyst                   1    Master's   200000
2   Kolkata   Data Analyst                   2         PhD   350000
3   Kolkata   Data Analyst                   3  Bachelor's   400000
4   Kolkata   Data Analyst                   4    Master's   600000
..      ...            ...                 ...         ...      ...
85     Pune  Java Engineer                   5         PhD   900000
86     Pune  Java Engineer                   6  Bachelor's  1000000
87     Pune  Java Engineer                   7    Master's  1200000
88     Pune  Java Engineer                   2  Bachelor's   300000
89     Pune  Java Engineer                   3    Master's   400000

[90 rows x 5 columns]

In [317]:
sample_data = pd.read_csv(r'sample_test_data.csv')
sample_data

    Location        Job Role  Experience (Years)      Degree
0  Bangalore  Data Scientist                   3  Bachelor's

In [318]:

location_encoder = LabelEncoder()
job_role_encoder = LabelEncoder()
degree_encoder = LabelEncoder()

location_encoder.fit(data['Location'])
job_role_encoder.fit(data['Job Role'])
degree_encoder.fit(data['Degree'])

LabelEncoder()

In [319]:
sample_data['Location'] = location_encoder.transform(sample_data['Location'])
sample_data['Job Role'] = job_role_encoder.transform(sample_data['Job Role'])
sample_data['Degree'] = degree_encoder.transform(sample_data['Degree'])
sample_data

   Location  Job Role  Experience (Years)  Degree
0         0         1                   3       0

In [320]:
data['Location'] = location_encoder.transform(data['Location'])
data['Job Role'] = job_role_encoder.transform(data['Job Role'])
data['Degree'] = degree_encoder.transform(data['Degree'])
data

    Location  Job Role  Experience (Years)  Degree   Salary
0          1         0                   0       0        0
1          1         0                   1       1   200000
2          1         0                   2       2   350000
3          1         0                   3       0   400000
4          1         0                   4       1   600000
..       ...       ...                 ...     ...      ...
85         2         2                   5       2   900000
86         2         2                   6       0  1000000
87         2         2                   7       1  1200000
88         2         2                   2       0   300000
89         2         2                   3       1   400000

[90 rows x 5 columns]

In [321]:
X = data[['Location', 'Job Role', 'Experience (Years)', 'Degree']]
y = data['Salary']

In [322]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)
rfrg = RandomForestRegressor(n_estimators=100,random_state=1)
X_test

    Location  Job Role  Experience (Years)  Degree
2          1         0                   2       2
13         1         1                   3       2
53         0         2                   3       0
41         0         1                   1       0
66         2         0                   6       0
30         0         0                   0       0
45         0         1                   5       1
43         0         1                   3       2
78         2         1                   2       2
89         2         2                   3       1
7          1         0                   7       1
26         1         2                   6       0
33         0         0                   3       0
63         2         0                   3       0
8          1         0                   2       0
16         1         1                   6       2
24         1         2                   4       1
56         0         2                   6       0

In [323]:
rfrg.fit(X_train,y_train)
y_pred = rfrg.predict(X_test)
mean_squared_error(y_test,y_pred)
score = r2_score(y_test, y_pred)
score = score * 100
int(score)

93

In [324]:
prediction_with_sample_data = rfrg.predict(sample_data)
int(prediction_with_sample_data)

695000